# MEPCalculationServerInfo Methods

---
C#Visual BasicVisual C++
Include Protected MembersInclude Inherited Members
Revit 2024 API
---
MEPCalculationServerInfo Methods
MEPCalculationServerInfo Class See Also
---
The MEPCalculationServerInfo type exposes the following members.
# Methods
| Name | Description |
| --- | --- |
| --- | --- | --- |
| Dispose |
| Equals | Determines whether the specified Object is equal to the current Object. (Inherited from Object.) |
| GetHashCode | Serves as a hash function for a particular type.  (Inherited from Object.) |
| GetMEPCalculationServerInfo | Gets a MEPCalculationServerInfo by family instance. |
| GetType | Gets the Type of the current instance. (Inherited from Object.) |
| ToString | Returns a string that represents the current object. (Inherited from Object.) |

# See Also
MEPCalculationServerInfo Class
Autodesk.Revit.DB Namespace